#+SETUPFILE: ./theme-bigblow.setup
#+options:    H:5 num:nil toc:t \n:nil ::t |:t ^:t f:t *:t

* 技术

** DONE 学习 org mode [100%]                                           :self:
    CLOCK: [2018-01-04 Thu 15:36]--[2018-01-04 Thu 16:06] =>  0:30
    CLOCK: [2017-12-04 Mon 10:47]--[2017-12-04 Mon 12:14] =>  1:17
- [X] 了解时间管理的工作流程
- [X] 看看能不能把一天的时线给打印出来
- [ ] 把当前任务显示在 tmux 状态栏中

** DONE emacs 进入 evil 时代
    CLOCK: [2017-12-05 Tue 15:35]--[2017-12-05 Tue 15:45] =>  0:10

1. 为什么要用 evil？
   h/j/k/l 用起来爽

** TODO 了解邻接表，和学弟沟通 [50%]                                   :self:
    CLOCK: [2017-12-04 Mon 12:30]--[2017-12-04 Mon 13:00] =>  0:30
- [X] 大概懂了邻接表是个啥
- [ ] 实现 pta 某个题

**** DONE c 语言结构体
1. 结构体怎样初始化

**** TODO 用 c 语言实现一把拓扑排序
     CLOCK: [2017-12-13 Wed 11:05]--[2017-12-13 Wed 11:10] =>  0:05
用 c 语言实现解决 pta 那个 [[https://pintia.cn/problem-sets/16/problems/708][问题]]

** TODO feeluown 开发 [75%]
*** DONE feeluown 2.0 发版
    CLOSED: [2018-08-03 五 15:32]

[[https://github.com/cosven/FeelUOwn/projects/1]]

*** DONE feeluown-core 2.0 发版
    CLOSED: [2018-08-03 五 15:30]
    CLOCK: [2018-02-05 Mon 18:15]--[2018-02-05 Mon 20:24] =>  2:09

**** DONE show artist 等功能
     CLOSED: [2018-02-20 Tue 21:01]
**** DONE 确保 add/remove/list 等命令可用
     CLOSED: [2018-01-06 Sat 17:07]

**** DONE user 相关操作
     CLOSED: [2018-01-06 Sun 23:35]
     CLOCK: [2018-01-06 Sat 17:08]--[2018-01-06 Sun 23:35] => 22:27
**** DONE 本地播放列表
     CLOSED: [2018-01-14 Sun 19:14]
     CLOCK: [2018-01-07 Sun 15:36]--[2018-01-07 Mon 18:42] =>  3:06
*** DONE feeluown 2.0 推广
    CLOSED: [2018-08-05 日 15:35]
*** TODO emacs-fuo 完善
     CLOCK: [2018-02-26 Mon 10:35]--[2018-02-26 Mon 11:00] =>  0:25

- update melpa:MR

** TODO coursera 操作系统课程
**** DONE 第一章：操作系统概述
操作系统特征：共享、并发、随机、虚拟

**** TODO 第二章：操作系统运行环境
** TODO 《unix 网络编程》
** TODO 《operating system: three easy pieces》
*** TODO 进程相关 [100%]
    CLOCK: [2018-01-04 Thu 12:30]--[2018-01-04 Thu 14:00] =>  1:30
- [X] 进程状态 -> 请见读书笔记 three easy pieces
- [ ] PCB 是个啥？

** TODO gunicorn 模型
**** TODO 当一个 worker timeout 之后，gunicorn 会干什么
** TODO 分布式任务队列 -> 了解分布式
*** TODO Celery 的执行模型

- [ ] 是 worker prefetch 了 task，还是 process prefetch 了？
- [ ] after a task is prefetched, is it possible to re-schedule the task
to other process or worker

*** TODO 激发好奇心的问题
***** TODO 单机并发和分布式是否矛盾，或者说它们是否有机结合？
比如说，协程可以和分布式系统一起使用吗？推荐这么用吗？
***** TODO 分布式任务队列最简单的起源在哪？
***** TODO 了解 AMQP？
** TODO [#A] 协程相关
*** DONE 学习死锁
    CLOSED: [2018-08-07 二 15:28]
[[http://cosven.me/blogs/74]]

** TODO [#A] Python 2to3
    CLOCK: [2018-03-01 Thu 10:59]--[2018-03-01 Mon 18:32] =>  7:33

** TODO 朋友兴趣爱好等备忘 2333
好记性不如烂笔头

- [X] 带酒酿 + 糍粑 + 红薯片？
- [X] 坛子菜可以带么？
- [ ] xxx 红色的口红？
- [ ] 木质调 - 星光 - 香水
- [ ] 珍珠
- [ ] 某妹子：运动鞋39、皮鞋38

** TODO 计算机原理
*** TODO Python 是怎样实现 int 的？
[[https://stackoverflow.com/questions/21871829/twos-complement-of-numbers-in-python][two's complement in python]]

** TODO mysql/redis 等存储系统
*** DONE mysql 索引的原理
     CLOSED: [2018-03-19 一 17:00] SCHEDULED: <2018-03-19 Mon 23:00>

** TODO graphviz algorithm
** TODO 为何不建个分区来记录自己喜欢的电影和音乐？
** TODO 基于文件的缓存系统或者数据库
- tinydb
- mmap'ed files
- BerkeleyDB


* 兴趣、爱好
** 学习姿势
1. python dev mail-list
2. python pep
3. paper
4. hackernews and github trending
5. best practices

** 神奇的歌曲
- Dirás Que Estoy Loco-Miguel Ángel Muñoz


* 阅读
** 日常阅读
*** 为什么现在又流行服务端渲染html？
      CLOCK: [2018-02-26 Mon 11:54]--[2018-02-26 Mon 12:04] =>  0:10

为什么现在又流行服务端渲染html？ - 方应杭的回答 - 知乎
https://www.zhihu.com/question/59578433/answer/326694511

SSR(Server side rendering) 主要有两个好处：SEO 和首屏渲染。

*** 微服务和 SOA 的区别
SOA 强调服务重用；多个服务可能会共享存储。
微服务强调解耦；互不影响，存储独立。

*** 缓存世界的三大问题
     CLOCK: [2018-03-16 Fri 00:30]--[2018-03-16 Fri 00:50] =>  0:20

[[https://juejin.im/post/5aa8d3d9f265da2392360a37][文章链接]]
1. 缓存穿透
   - 缓存空数据
   - BloomFilter: 它需要在缓存之前再加一道屏障，里面存储目前数据库中存在的所有key
2. 缓存雪崩
   - 高可用
3. 热点数据集中失效
   - 不同的过期时间
   - 互斥锁

*** kafka 和 redis pubsub 对比
     CLOCK: [2018-03-16 Fri 00:50]--[2018-03-16 Fri 01:16] =>  0:46

1. redis 适用于实时的消息分发，不保证可靠性
2. kafka 支持订阅者分组，从而实现负载均衡
3. kafka 支持持久化
4. kafka pub/sub 有 ack 机制

*** Python method 和 function 小讨论
     CLOCK: [2018-03-16 Fri 11:00]--[2018-03-16 Fri 11:56] =>  0:56
[[https://www.zhihu.com/question/268842195/answer/342894622][问题链接]]

* 旅游
** DONE 东北行调研
    CLOSED: [2017-12-26 Tue 23:18]
- *漠河总结* 如果有票，就可以去，前后两天假，住宿条件，游玩基本没有问题。价格大概 800 - 1000 - 1250 左右。
- *雪乡总结* 看下面
**** DONE 漠河行程方案 -> 放弃漠河
***** DONE 飞机方案

29 号 11:00 北京到漠河 15:30: 1700

好处：29 号到漠河，去程不慌不忙
劣势：多花费 1000 左右

***** DONE 火车方案 -> 哈尔滨 -> 漠河

1. 28号晚上火车去哈尔滨，29号早上到 --- 软：400，硬：260
1. 哈尔滨停留半天
2. 29号晚上火车去漠河，30 早上到 ---
3. 在漠河睡一个晚上（玩一天半）
4. 31号晚上火车去哈尔滨
5. 1 号下午高铁回北京（这样子的话，回北京就晚上 11 点左右了

好处：经典路线？
劣势：需要抢北京到哈尔滨到漠河的车票

***** DONE 火车方案 -> 齐齐哈尔 -> 漠河
齐齐哈尔到漠河飞机太贵 -> 不靠谱

1. 28 火车从北京到齐齐哈尔：T47 19:00 -> 9:45。29 号上午到齐齐哈尔
1. 齐齐哈尔停留半天
2. 29 号晚上，齐齐哈尔到漠河：K7041 22:06 -> 09:57。30 号到漠河
3. 回程没啥区别

好处：路线还行，相比于哈尔滨，只需要抢一张票

**** DONE 其它游玩景点研究
     CLOCK: [2017-12-20 Wed 08:00]--[2017-12-20 Wed 09:10] =>  1:10
     CLOCK: [2017-12-19 Tue 20:47]--[2017-12-19 Tue 21:30] =>  0:43

***** 沈阳
最多玩一天差不多了
帅府；博物馆；918 博物馆等历史风景
东三省中心城市？

**** DONE 跟团游调研
     CLOCK: [2017-12-22 Fri 20:00]--[2017-12-22 Fri 21:56] =>  1:56
***** 哈尔滨到雪乡到吉林
总评：路线还不错，但是 29 号需要请一天假。
需要抢长春/吉林到北京的票。请不到的话，2 号也要请一天假。
http://www.youxiake.com/lines.html?id=20514

早上 6.15 哈尔滨集合
最早一趟到哈尔滨的火车是 6.12，所以得提前一天到

吉林返回：13：00 以后 ->
长春返回：15：00 以后返回的票 ->
目前都没票

***** 漠河 - 游侠客（4 天，时间不够，放弃）
第一天（30 号上午到漠河）：全国 - 漠河
第二天（31 号）：
第三天（1 号）：
第四天（2 号）：

***** 代替定火车票
哈尔滨到漠河，提前 7 天，150 一个人

***** 漠河 - 小北旅行
- 时间：3 天 - 可以
- 价格：越野 1280 / 轿车 1000
- 评价都还不错
- 但是不包火车票
- 住宿条件没说清楚 - 问了，有标间，也有 4 人炕

***** 漠河 - 大伟自由行
- 时间：3 天
- 价格：680 / 1280
- 评价都还不错
- 不饱火车票
- 住宿：一晚火炕，一晚标间
- 价格差别的地方：住宿条件提高许多，小火炕 vs 体验火炕；车；多了两个项目。

***** 雪乡 - 金牌旅游 - 3 日游 - 有两人炕 1000 - 17000 - 1199 每人
***** 雪乡 - 龙美旅行 - 2 日游 - 正常拼炕 - 加 400 块钱可以双人炕 - 760 - 1350 - 950 每人
***** 雪乡 - 天狼户外旅行 - 3 日游（哈尔滨晚上酒店他们订好了） - 双人坑（两晚总共 600 块钱）- 1580 每个人
***** 雪乡 - 卡兹户外 - 3 日游 - 拼炕 - 4 人 - 男女分开
***** 雪乡 - 北方假期 - 3 日游 - 已满


* 折腾
** Emacs 折腾
**** DONE 折腾 Python IDE -> Elpy
    CLOCK: [2017-12-14 Thu 12:59]--[2017-12-14 Thu 23:00] => 10:01
**** DONE Emacs workspace 管理
     CLOCK: [2017-12-18 Tue 20:35]--[2017-12-18 Tue 22:00] =>  1:25
perspeen 代替以前的 iTerm2 + Vim + Tmux + shell 的工作模式
**** DONE Emacs GUI 可以作为 Daemon 吗？
     CLOSED: [2018-01-08 Mon 11:29]
目前结论，不能。
正确的姿势可能是：
1. 在终端启动一个 Daemon
2. emacsclient -c 打开一个 frame 以使用 GUI

更新：可以呀，而且简单的很 =(server-start)= 就搞定了

**** DONE 滚动设置
     CLOCK: [2018-01-16 Tue 10:34]--[2018-01-16 Tue 11:34] =>  1:00

=(setq next-screen-scroll-context-lines 10)=
但是这个设置貌似并没有用。



* 哲学
** 我是谁？我在哪里？

* 系统设计
** 部署系统
**** 一些概念
- 金丝雀 /发布/ 是测试新代码是否正常工作的手段，对于比一次性全量上线。
- 滚动 /部署/ 是是上线新代码的一种部署策略，对比于蓝绿部署。

**** 关于部署的一些设计上的疑问？
***** 如果线上存在多个版本，在进行下一次部署之前，是否需要将多余的版本清除？
进行金丝雀发布时，我们需要让线上生产环境只保留一个版本。我们应该是需要
保证线上的保留的这个版本是能正常工作的版本。
但如果线上没有版本能正常工作呢（对于一个成熟的项目，基本不可能发生）？
** 构建系统
**** Context
build_id: app
**** 关于 PaaS 是传元信息过来还是构建参数
其实传元信息就意味着构建系统需要理解 PaaS

现在实现方式是：传元信息。原因是 Jenkins 自带的 rebuild 功能
没有走 API。
**** TODO pip 的缓存逻辑
** 功能开关、配置、A/B 测试

facebook 那篇文章最主要的还是配置，关于 A/B Test 涉及比较少。关于 A/B Test 目前多是参考 google 这篇论文
https://static.googleusercontent.com/media/research.google.com/en//pubs/archive/36500.pdf

ABTest / 配置管理 / 功能开关体系这篇 paper 写的最好
http://sigops.org/sosp/sosp15/current/2015-Monterey/printable/008-tang.pdf

**** TODO 《Holistic Configuration Management at Facebook》
     CLOCK: [2018-03-12 Mon 13:20]--[2018-03-12 Mon 14:40] =>  1:20
- 为什么要看这篇 paper？
- 它大概讲了什么？
- 它有解决你的问题吗？
- 你对它哪个部分最感兴趣？

***** 为什么看这篇 paper？
一天，我在知乎上看到一篇文章讲“[[https://zhuanlan.zhihu.com/p/32712056][怎样才是真正的灰度发布]]”。

它从这三个方面讲：
1. 精确地流量分发控制。根据用户 ID 或者用户所在地域（省份）等方面进行流量分发控制。
2. 监控系统支撑，监控一些指标变化。产品方面：点击率，pv，uv；应用层：错误率，吞吐量；
基础设施层：CPU，内存等。
3. 灵活的发布系统。支持服务多个版本（长期）共存等。

其中，我对文章这样一句话“也就是硅谷里常说的 A/B testing，也可以归到灰度发布的范畴。”
印象比较深刻。在我理解中，灰度发布即为灰度部署，和A/B 测试没有必然关系。
灰度发布更倾向保证新版本代码可以正确运行，而 A/B test 是为产品服务的，优化产品策略用。

一谈到 A/B testing，我就想起一位同事经常推荐的这篇 paper。不过这 paper 和灰度发布
好像没半毛钱关系。

***** 它大概讲了什么？

*摘要*: This paper gives a comprehensive description of the use cases,
design, implementation, and usage statistics of a suite of tools
that manage Facebook’s configuration end-to-end, including
 the frontend products, backend systems, and mobile apps.

- *Runtime configuration management* is an important problem for
 Internet services, but it is not well defined in the literature.
We describe the problem space and the real use cases from our experience,
in the hope of motivating future research in this area.
- We describe *Facebook’s configuration management stack*, which addresses
 many challenges not covered by prior work, e.g., gating product rollouts,
config authoring, automated canary testing, mobile config,
and a hybrid subscription-P2P model for large config distribution.
This is the first published solution of holistic configuration management
 for Internet services.
- We report the *statistics and experience* of operating a large-scale
configuration management stack, which are made available in the
 literature for the first time. For exam- ple, do old configs become dormant,
and how often do config changes expose code bugs?


*配置管理的主要挑战* ：

- *Configuration sprawl* （配置混乱）：Historically, each system could use its own configuration store and
 distribution mechanism, which makes the site as a whole hard to manage.
- *Configuration authoring and version control* （配置编写与版本控制）.
- *Defending against configuration errors*.
- *Configuration dependency* ：For example, after the monitoring tool’s config
 is updated to enable a new monitoring feature, the monitoring configs
 of all other systems might need be updated accordingly.
- *Scalable and reliable configuration distribution*.

*场景和解决方案* ：

- Gating new product features.（大概理解为灰度？）
- Conducting experiments.（大概理解为 A/B 测试把）
- Application-level traffic control. 比如修改 HAProxy 配置？
- Topology setup and load balancing. （基础设施变更
- Monitoring, alerts, and remediation.（调整报警参数）
- Updating machine learning models.
- Controlling an application’s internal behavior.（比如调整容器 CPU）

*用到的工具* ：

- *Configerator* provides all the foundational functions, including version control,
 authoring, code review, automated canary testing, and config distribution.
Other tools are built on top of Configerator and provide specialized functions.
- *Gatekeeper* controls the rollouts of new product features. Moreover, it
can also run A/B testing experiments to find the best config parameters.
- PackageVessel uses peer-to-peer file transfer to assist the distribution
 of large configs.
- Sitevars is a shim layer that provides an easy-to-use configuration API
for the frontend PHP products.
- MobileConfig manages mobile apps’ configs on Android and iOS, and bridges
 them to the backend systems such as Configerator and Gatekeeper.


*Configerator, Sitevars, and PackageVessel*

- *Configuration Authoring*: 用代码生成配置（thrift 等）
- Improving Usability through UI and Sitevars
- Preventing Configuration Errors
- Scalable and Reliable Configuration Distribution（ZooKeeper）
- Distributing Large Configs through PackageVessel
- Improving Commit Throughput（多个同时更改（同一个）配置）
- Fault Tolerance
***


** TODO 常见系统设计
*** TODO 点赞系统

* 其它
** TODO 迁徙事宜 [/]                                                   :self:
**** TODO 杭州有哪些大的互联网公司？

**** TODO 杭州有哪些 Python 牛人？

**** TODO 杭州有哪些酷酷的公司？

**** TODO 杭州有哪些 Python 大厂？

**** TODO 杭州有什么搞物联网/机器人厂？

**** TODO 网易杭州有哪些工作？
- [[https://www.lagou.com/jobs/3943966.html][Python 游戏服务端 3-5 年工作经验]]

**** TODO 阿里有哪些工作？
** 杂碎记录
*** 朋友无脑沟通？
***** 围观高老板面试
      CLOCK: [2018-02-27 Tue 10:44]--[2018-02-27 Tue 11:44] =>  1:00
*** aha，聊人生？
**** 工作生活 with amy
     CLOCK: [2018-02-27 Tue 12:10]--[2018-02-27 Tue 12:47] =>  1:47
**** 生活工作 with 高老板
     CLOCK: [2018-02-27 Tue 13:00]--[2018-02-27 Tue 13:50] =>  0:50

** TODO 调研 Python 大牛都在干嘛，能干嘛？
